{
    "myIndexTitle": "Homepage",
    "myJob": "Associate Professor - Verimag/UGA (Grenoble, France)",
    "myHome": "Home",
    "myCurriculum": "Curriculum Vitae",
    "myResearch": "Research",
    "mySoftware": "Software",
    "myTeaching": "Teaching",
    "myPersonal": "Personal",
    "myAbout": "About",
    "myDefense": "Details on my PhD",
    "myHereLink": "here",
    "myResume": "My resume (in French)",
    "myCode": "Sources are available",
    "myPoweredBy": "Powered by",
    "myEducation": "Education",
    "myPhDShort": "PhD Thesis",
    "myPhDJob": "PhD Candidate",
    "myPhD": "PhD thesis prepared at TIMA laboratory, in the System Level Synthesis (SLS) team." ,
    "myPhDTopic": "Topic:",
    "myPhDTitle": "\"Leveraging Hardware Construction Languages for Flexible Design Space Exploration on FPGA\"",
    "myEnsimag": "Engineering Degree in Computer Science and Applied Mathematics",
    "myMajor": "Major in Embedded Software and Systems",
    "myCySec": "MSc in CyberSecurity",
    "myBio": "Biography",
    "myBioContent": "I graduated from Grenoble INP - Ensimag in 2018, where I studied Embedded Systems and Software, and Université Grenoble Alpes, where I studied CyberSecurity. My PhD researches were then directed by Frédéric Rousseau and supervised by Olivier Muller, between 2018 and 2022, in the SLS team at TIMA lab. We aimed at using the emerging paradigm of Hardware Construction Languages to build a flexible exploration methodology, and provided a PoC framework based on Chisel, as well as an applicative benchmark. From March 2022 to August 2023, I was a post doctoral fellow at LIP laboratory (Lyon), in the CASH team. I worked on formal verification of electronical circuits (ERC) at transistor level, in collaboration with Aniah, a Grenoble-based company, and Verimag laboratory.",
    "myCurrentContent": "Since September 2023, I am an Associate Professor (MCF) in Grenoble. I'm doing my research at Verimag, and I'm teaching at Université Grenoble Alpes (UGA), mainly in UFR IM²AG.",
    "myUsefulLinks": "Useful links:",
    "mySlsSite": "SLS team website",
    "myVerimagSite": "Verimag lab website",
    "myUFRSite": "UFR IM²AG website",
    "myCashSite": "CASH team website",
    "myAniahSite": "Aniah website",
    "myProjects": "Projects",
    "myLink": "Link",
    "myERCTool1": "Software prototype for Electrical Rule Checking (ERC) on integrated circuits at transistor level. Developped during my post doc, along with",
    "OussamaCIFRE": "Oussama Oulkaid, CIFRE PhD candidate",
    "myERCTool2": "Due to the industrial context, the software is not distributed online",
    "myQece": "Framework which allows the users to define adaptable estimation methodologies for digital circuits, and flexible design space exploration strategies.",
    "myQeceBenchmark": "Benchmark of FPGA representative applications, used to demonstrate the usability of QECE on various use cases.",
    "myHomepage": "Sources of this webpage",
    "myThesisTemplateName": "PhD manuscript",
    "myThesisTemplate": "LaTeX sources for the generation of my PhD dissertation.",
    "myThematics": "Topics",
    "myDSE": "Design Space Exploration",
    "myInternationalProceedings": "International Conferences and Workshops",
    "myTeachingTitle": "Teaching",
    "myTeachingTraining": "Pedagogical training",
    "myLabelRes": "Label «Research and Teaching at University»",
    "myLabelResContent": "Set of classes which aims to train students to the professor job. A dissertation on this training and on my teaching experience can be found",
    "myLabelResAdditional": " (in French)",
    "myLabelResSite": "Training website (in French).",
    "myTeachingIntro": "Current lectures (in French)",
    "myEnsimagClasses": "Basics on computer architectures and digital design\nProcessor programming (MIPS/RISC-V assembly)\nC programming project (building a graphic library).",
    "myPolytechClasses": "UNIX project: how to use the system primitives to program a mail Client through explicit synchronization.",
    "myPersonalTitle": "Personal",
    "myTODO": "Whoops... There is nothing here !",
    "myNow": "now",
    "myExperience": "Professional Experience",
    "myPostDocTitle": "Post doctoral researcher",
    "myPostDocShort": "Formal verification of electrical rules at transistor level",
    "myMCFTitle": "Associate Professor",
    "myMCFResearchTitle": "Research:",
    "myMCFResearchShort": "Digital design and verification",
    "myMCFTeachingTitle": "Teaching:",
    "myMCFTeachingShort": "Software/Hardware Architecture, Hardware Security",
    "myPhDThesis": "PhD Thesis",
    "myPhDLong": "Hardware Construction Language based design methodology for FPGA circuits",
    "myMonths": "months",
    "myEdifixioTitle": "End of Study Project (internship)",
    "myEdifixio": "Web security",
    "myGermany": "Germany",
    "mySAPTitle": "Engineering internship",
    "mySAP": "Data science",
    "myMatoomaTitle": "Internship & fixed-term job",
    "myMatooma": "Web development and database management",
    "myResearchProjectTitle": "Research Project",
    "myResearchProject": "My research project focus on conceiving and adapting high level tools and methods for digital design. More practically, I want to use my expertise about Chisel and formal methods to provide more efficient flows to design circuits, and better tools to analyze them.",
    "myResearchProjectIntr": "In order to do so, I focus on 3 complementary directions, which all revolves around circuit design and verification:", 
    "myResearchProjectAxe1": "I want to improve the methods and tools to analyze a design, with a particular focus on how one can verify circuits generator written in Chisel.",
    "myResearchProjectAxe2": "I want to enable the use of Chisel in industrial usecases, by allowing the integration of Chisel-based components along with components described using a different design paradigm, such as High Level Synthesis (HLS). More practically, I want to provide a framework to efficiently compile hardware kernels written with different paradigms, and integrate them in a single top level circuit, which means providing a way to interface them.",
    "myResearchProjectAxe3": "I want to improve existing design flows, using the generation capabilities provided by hardware construction languages.",
    "myModelChecking": "Model Checking",
    "myInternationalReviews": "International Reviews",
    "myTODAESStatus": "Accepted at ACM Transactions on Design Automation of Electronic Systems (TODAES) on 23 March 2023.",
    "myDate2023": "Short paper (2 pages) and poster",
    "myENSClasses": "C and OCaml programming: preparing students for the practical part of the 'agregation' in Computer Sciences (exam to teach in highschool and preparatory classes)",
    "myArchi2023Title": "Thematic School - Archi 2023",
    "myArchi2023Slides": "The slides of the lecture are available",
    "myArchi2023Sources": "Sources for the practical lab are available",
    "myMarch": "March",
    "myArchi2023Lecture": "Introduction lecture to Chisel, and the concept of Hardware Construction Language.",
    "myArchi2023Volume": "Lecture: 1h30\nPractical works: 1h30",
    "myWebsite": "Website:",
    "myArchiWebsite": "Website of the event:",
    "myObfuscatedMail": "bruno[dot]ferres[at]univ-grenoble-alpes[dot]fr",
    "myENSDebugLesson": "Practical works on GDB usage for C programming.",
    "myTODAESAuthorVersion": "Author version on ArXiV",
    "myAuthorVersion": "Author version",
    "myPublications": "Publications",
    "myTmpTeachingIntro": "Teaching as a non permanent staff (2018-2023)",
    "myYear": "Year",
    "myPlace": "Place",
    "myUE": "Class",
    "myVolume": "Hours",
    "myInCharge": "In charge",
    "myEmailAddress": "Email address",
    "myMailAddress": "Mail address",
    "myResearchInterests": "Research Interests",
    "myResearchIntro": "Currently, my research interests revolve around the verification of embedded systems, both for safety (response time, ...) and security concerns. More specifically, I am interested in using formal methods for verification at various abstraction level, from the transistor-level to the CPU level. I am also interested in compilation, especially the low-level aspects of RISC-V compilation.",
    "myVerificationTitle": "Modelling and Verification of Low-Level Systems",
    "myDesignTitle": "Programming paradigms for digital design",
    "myCurrentProjects": "Current Research Projects",
    "mySupervisedStudents": "Supervised Students",
    "myOpenPositions": "Open Positions",
    "noPositionOpened": "No position is available at the moment.\nHowever, if you are interested in my research activities, do not hesitate to contact me to discuss opportunities for an internship, a thesis or a postdoc!",
    "myPhDStudents": "PhD Students",
    "myOussamaTopic": "Formal Verification Techniques for Electrical Rule Checking of Integrated Circuits",
    "myOussamaAdvising": "Industrial thesis supervised by Matthieu Moy, HDR (LIP), and advised with Pascal Raymond (Verimag) and Mehdi Khosravian (Aniah)", 
    "myInternStudents": "Internships",
    "myAniahProjectTitle": "\"Formal Verification of Integrated Circuits at Transistor Level\"",
    "myAniahProjectContext": "industrial collaboration with LIP (Lyon) and Aniah",
    "myArseneProjectTitle": "\"Hardware and Software Security of Embedded Systems\"",
    "myArseneProjectContext": "ANR Arsene - PEPR CyberSécurité",
    "myCaoticProjectTitle": "\"Collaborative Action on Timing Interference\"",
    "myCaoticProjectContext": "ARN CAOTIC",
    "myInternships": "Internship proposals",
    "myCelticInternship2023": "Modeling and Characterizing Fault Attacks exploiting the Memory Architecture",
    "myCompCertInternship2023": "Proved-Secure Compilation for RISC-V Processor",
    "myCurrentProjectIntro": "I am currently involved in the following research projects",
    "mySelfJobProposal": "If you are interested in my research activities, do not hesitate to contact me to discuss opportunities for an internship, a thesis or a postdoc (even if no job proposal does fit your need!).",
    "myNews": "Latest news",
    "myJobNewsDate": "October 2023",
    "myJobNews": "Check my \"Research\" page for two internship proposals about low-level security of embedded systems!",
    "myWith": "with",
    "myAnd": "and",
    "mySummary": "Summary",
    "myDetails": "Details",
    "myLastUpdate": "Last update on 25 october 2023"
}
