{
    "myIndexTitle": "Page d'accueil",
    "myJob": "Post Doc au LIP (Lyon)",
    "myHome": "Accueil",
    "myCurriculum": "Curriculum Vitae",
    "myResearch": "Recherche",
    "mySoftware": "Logiciels",
    "myTeaching": "Enseignements",
    "myPersonal": "Personnel",
    "myAbout": "À propos",
    "myDefense": "Informations sur ma thèse",
    "myResume": "Mon CV",
    "myHereLink": "ici",
    "myCode": "Les sources sont disponibles",
    "myPoweredBy": "Basé sur",
    "myEducation": "Formation",
    "myPhDShort": "Thèse de doctorat",
    "myPhD": "Thèse de doctorat préparée au sein de l'équipe SLS du laboratoire TIMA.",
    "myPhDTopic": "Sujet :",
    "myPhDTitle": "\"Utilisation de langages de construction matérielle pour une exploration flexible des espaces de conception sur FPGA\"",
    "myEnsimag": "Diplôme d'Ingénieur en Informatique et Mathématiques Appliquées",
    "myMajor": "Spécialité en Systèmes et Logiciels Embarqués (SLE)",
    "myCySec": "Master en Cybersécurité",
    "myBio": "Biographie",
    "myBioContent": "Je suis diplomé de l'Ensimag (promo 2018), où j'ai étudié les Systèmes et Logiciels Embarqués, et de l'Université Grenoble Alpes, où j'ai obtenu un double diplôme en cyber-sécurité. Ma thèse a ensuite été dirigée par Frédéric Rousseau et encadrée par Olivier Muller, entre 2018 et 2022, dans l'équipe SLS du laboratoire TIMA. Ces recherches visaient à utiliser le paradigme émergent des languages de construction matérielle pour développer une méthodologie flexible d'exploration d'espace de conception, avec un logiciel prototype et un banc d'applications proposés en Chisel.",
    "myPostDoc": "Depuis Mars 2022, je suis en post doc dans l'équipe CASH du laboratoire LIP, à Lyon. Je travaille sur la vérification formelle de circuits électroniques (ERC) au niveau transistor, en collaboration avec Aniah, une entreprise grenobloise",
    "myUsefulLinks": "Liens utiles :",
    "mySlsSite": "Site web de l'équipe SLS",
    "myCashSite": "Site web de l'équipe CASH",
    "myAniahSite": "Site web d'Aniah",
    "myProjects": "Projets",
    "myLink": "Lien",
    "myERCTool1": "Prototype logiciel pour l'identification d'erreurs électriques (Electrical Rule Checking, ou ERC) sur des circuits décrits au niveau transistor. Développé durant mon post doctorat, en collaboration avec",
    "OussamaCIFRE": "Oussama Oulkaid, doctorant CIFRE",
    "myERCTool2": "Le prototype n'est pas disponible en ligne, en accord avec notre partenaire industriel",
    "myQece": "Prototype logiciel permettant à la fois de définir des méthodologies adaptables d'estimation de circuit numérique, et des processus flexibles d'exploration d'espace de conception.",
    "myQeceBenchmark": "Banc d'applications représentatives de l'utilisation des FPGAs, utilisé pour démontrer l'utilisabilité de QECE sur divers cas d'utilisation.",
    "myHomepage": "Sources de cette page web", 
    "myThesisTemplateName": "Manuscrit de thèse",
    "myThesisTemplate": "Sources LaTeX pour la génération de mon manuscrit de thèse.",
    "myThematics": "Thématiques",
    "myDSE": "Exploration d'espace de conception",
    "myInternationalProceedings": "Conférences internationales",
    "myTeachingTitle": "Enseignements",
    "myTeachingTraining": "Formations à l'enseignement",
    "myLabelRes": "Label \"Recherche et Enseignement Supérieur\"",
    "myLabelResContent": "Ensemble de formations visant à former les doctorant·es au métier d'Enseignant/Chercheur. Un mémoire portant sur cette formation et mon expérience d'enseignement peut être trouvé",
    "myLabelResAdditional": "",
    "myLabelResSite": "Site web du label RES.",
    "myTeachingDetails": "Détails",
    "myEnsimagClasses": "Architecture: circuits numériques et éléments d'architecture\nExploitation des processeurs (assembleurs MIPS & RISC-V)\nProgrammation en C (projet de conception d'une bibliothèque graphique).",
    "myPolytechClasses": "Projet UNIX: utilisation de primitives systèmes pour concevoir un client de messagerie basé sur une synchronisation explicite.",
    "myPersonalTitle": "Personnel",
    "myTODO": "Oups... Il n'y a rien pour l'instant!",
    "myNow": "maintenant",
    "myExperience": "Expérience Professionelle",
    "myPostDocTitle": "Chercheur post-doctoral",
    "myPostDocShort": "Vérification formelle de règles électriques au niveau transistor",
    "myPhDThesis": "Thèse de doctorat",
    "myPhDLong": "Méthodologie de conception de circuits pour FPGA basée sur le paradigme de construction matérielle",
    "myMonths": "mois",
    "myEdifixioTitle": "Projet de Fin d'Etude",
    "myEdifixio": "Sécurité Web",
    "myGermany": "Allemagne",
    "mySAPTitle": "Stage Assistant Ingénieur",
    "mySAP": "Data science",
    "myMatoomaTitle": "Stage et CDD",
    "myMatooma": "Développement Web, gestion de base de donnée",
    "myResearchProjectTitle": "Projet de recherche", 
    "myResearchProject": "Mon projet de recherche s'intéresse à la création et l'adaptation de méthodes et outils de haut niveau pour la conception numérique. En pratique, je souhaite utiliser mon expertise en Chisel et en méthodes formelles pour proposer des outils et méthodes de conception plus efficaces, et de meilleurs outils pour les analyser.",
    "myResearchProjectIntr": "Pour ce faire, je m'intéresse principalement à trois axes complémentaires, qui tournent tous autour de la conception de circuits numérique et leur vérification :",
    "myResearchProjectAxe1": "Je souhaite améliorer les approches existantes pour analyser un circuit, avec un intérêt particulier sur la vérification de propriétés sur des générateurs de circuits décrits en Chisel.",
    "myResearchProjectAxe2": "Je veux permettre d'utiliser Chisel dans des cas d'usage industriels, en permettant l'intégration de composés écrits en Chisel avec des composants décrits grâce à d'autres paradigme de conception, comme la synthèse de haut niveau (HLS). En pratique, je souhaite proposer un environnement de développement pour compiler efficacement des noyaux de calculs décrits dans les paradigmes différents au sein d'un seul circuit. Cela signifie également s'intéresser aux interfaces entre ces différents kernels.",
    "myResearchProjectAxe3": "Je souhaite améliorer les flots de conception existants, notamment en intégrant les fonctionnalités de génération fournies par les langages de construction matérielle.",
    "myModelChecking": "Model Checking",
    "myInternationalReviews": "Revues internationales",
    "myTODAESStatus": "Accepté à la publication dans le journal ACM Transactions on Design Automation of Electronic Systems (TODAES) le 23 mars 2023.",
    "myDate2023": "Papier court (2 pages) et poster",
    "myENSClasses": "Programmation en C et en OCaml: préparation des étudiant·es à l'épreuve de programmation de l'agrégation d'informatique.",
    "myArchi2023Title": "Ecole thématique - Archi 2023",
    "myMarch": "mars",
    "myArchi2023Lecture": "Cours d'introduction à Chisel, et au concept de langage de construction matérielle en général.",
    "myArchi2023Slides": "Le support du cours est disponible",
    "myArchi2023Sources": "Les sources du TP sont disponibles",
    "myArchi2023Volume": "Cours magistral: 1h30\nTravaux pratique: 1h30",
    "myWebsite": "Site :",
    "myArchiWebsite": "Site de l'évenement :",
    "myQualif": "Je suis qualifié en section 27 (informatique) du CNU, ce qui m'autorise à concourir pour les postes de Maître de Conférences en France.",
    "myObfuscatedMail": "bruno[point]ferres[arobase]inria[point]fr",
    "myENSDebugLesson": "Travaux pratiques sur l'utilisation de GDB pour la programmation en C.",
    "myTODAESAuthorVersion": "Version auteur sur ArXiV",
    "myAuthorVersion": "Version auteur",
    "myPublications": "Publications",
    "myTeachingSummary": "Résumé",
    "myYear": "Année",
    "myPlace": "Lieu",
    "myUE": "Unité d'enseignement",
    "myVolume": "Volume",
    "myInCharge": "Responsable(s)",
    "mySupervisedStudents": "Étudiant(e)s supervisé(e)s",
    "myResearchInterests": "Intérêts de recherche",
    "myLastUpdate": "Dernière mise à jour le 06 juin 2023"
}
